app/views/api/notes/show.json.jbuilder

UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "<div>1. Type your things.2</div><div> sdf sd </div><div><br></div><div> asd s s</div><div><br></div><div><br></div>"], ["updated_at", 2016-08-27 06:18:49 UTC], ["id", 1]]
---
  json.created_at @note.created_at
  json.updated_at @note.updated_at