app/controllers/api/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    # @notes = Note.all.where(notebook_id: params[:notebook_id])
    @notes = Note.all

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 7]]
---
  def destroy
    @note = Note.find(params[:id])
    id = @note.id
    @note.destroy!

INSERT INTO "notes" ("notebook_id", "body", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notebook_id", 2], ["body", "Edit your note in here!"], ["created_at", 2016-08-24 08:15:21 UTC], ["updated_at", 2016-08-24 08:15:21 UTC], ["title", "New Note"]]
---
  def create
    @note = Note.new(note_params)
    if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "<div>Pickup: 1) Milk 2) Eggs 3) Cheese 4) Fruit 5) est</div>"], ["updated_at", 2016-08-24 05:35:04 UTC], ["id", 2]]
---
  def update
    @note = Note.find(params[:id])
    @note.update_attributes!(note_params)