app/controllers/api/notebooks_controller.rb

SELECT "notebooks".* FROM "notebooks" WHERE "notebooks"."user_id" = $1  [["user_id", 1]]
---
  def index
    # @notebooks = Notebook.all
    @notebooks = Notebook.where(user_id: current_user.id)

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @notebook = Notebook.find(params[:id])

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "notebooks" WHERE "notebooks"."id" = $1  [["id", 5]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 34]]
---
  def destroy
    @notebook = Notebook.find(params[:id])
    id = @notebook.id
    @notebook.destroy!

INSERT INTO "notebooks" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title your notebook"], ["user_id", 1], ["created_at", 2016-08-25 05:19:57 UTC], ["updated_at", 2016-08-25 05:19:57 UTC]]
---
  def create
    @notebook = Notebook.new(notebook_params)
    if @notebook.save

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "notebooks" SET "title" = $1, "updated_at" = $2 WHERE "notebooks"."id" = $3  [["title", "title: title: To-Do List 2"], ["updated_at", 2016-08-25 21:25:27 UTC], ["id", 2]]
---
  def update
    @notebook = Notebook.find(params[:id])
    @notebook.update_attributes!(notebook_params)