app/controllers/api/tags_controller.rb

INSERT INTO "tags" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "+sd s"], ["created_at", 2016-08-27 05:37:02 UTC], ["updated_at", 2016-08-27 05:37:02 UTC]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @tag = Tag.new(tag_params)
    if @tag.save
      note = Note.find(params["note_id"])