app/views/api/notebooks/show.json.jbuilder

SELECT "notes".* FROM "notes" WHERE "notes"."notebook_id" = $1  [["notebook_id", 1]]
---
  json.user_id @notebook.user_id
  json.notes @notebook.notes.each do |note|